duxinglang-1/nRF9160_test/E2_V1_NCS1.9.0_TEST/src/gps/gps.c
#if defined(CONFIG_GNSS_SAMPLE_ASSISTANCE_MINIMAL)
	/* With minimal assistance, the request should be ignored if no GPS time or position
	 * is requested.
	 */
	if (!(last_agps.data_flags & NRF_MODEM_GNSS_AGPS_SYS_TIME_AND_SV_TOW_REQUEST)
		&& !(last_agps.data_flags & NRF_MODEM_GNSS_AGPS_POSITION_REQUEST))
	{
	#ifdef GPS_DEBUG
		LOGD("Ignoring assistance request because no GPS time or position is requested");
	#endif
		return;
	}
#endif /* CONFIG_GNSS_SAMPLE_ASSISTANCE_MINIMAL */

	requesting_assistance = true;

#ifdef GPS_DEBUG
	LOGD("Assistance data needed, ephe 0x%08x, alm 0x%08x, flags 0x%02x",
		last_agps.sv_mask_ephe,
		last_agps.sv_mask_alm,
		last_agps.data_flags);
#endif

#if defined(CONFIG_GNSS_SAMPLE_LTE_ON_DEMAND)
	lte_connect();
#endif /* CONFIG_GNSS_SAMPLE_LTE_ON_DEMAND */

	err = assistance_request(&last_agps);
	if(err)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to request assistance data");
	#endif
	}

#if defined(CONFIG_GNSS_SAMPLE_LTE_ON_DEMAND)
	lte_disconnect();
#endif /* CONFIG_GNSS_SAMPLE_LTE_ON_DEMAND */

	requesting_assistance = false;
}
#endif /* !CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE */

#if defined(CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST)
static void ttff_test_got_fix_work_fn(struct k_work *item)
{
#ifdef GPS_DEBUG
	LOGD("Time to fix: %u", time_to_fix);
#endif
	if(time_blocked > 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Time GNSS was blocked by LTE: %u", time_blocked);
	#endif
	}

#ifdef GPS_DEBUG
	LOGD("Sleeping for %u seconds", CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST_INTERVAL);
#endif
}

static int ttff_test_force_cold_start(void)
{
	int err;
	uint32_t delete_mask;

#ifdef GPS_DEBUG
	LOGD("Deleting GNSS data");
#endif

	/* Delete everything else except the TCXO offset. */
	delete_mask = NRF_MODEM_GNSS_DELETE_EPHEMERIDES |
		      NRF_MODEM_GNSS_DELETE_ALMANACS |
		      NRF_MODEM_GNSS_DELETE_IONO_CORRECTION_DATA |
		      NRF_MODEM_GNSS_DELETE_LAST_GOOD_FIX |
		      NRF_MODEM_GNSS_DELETE_GPS_TOW |
		      NRF_MODEM_GNSS_DELETE_GPS_WEEK |
		      NRF_MODEM_GNSS_DELETE_UTC_DATA |
		      NRF_MODEM_GNSS_DELETE_GPS_TOW_PRECISION;

	/* With minimal assistance, we want to keep the factory almanac. */
	if(IS_ENABLED(CONFIG_GNSS_SAMPLE_ASSISTANCE_MINIMAL))
	{
		delete_mask &= ~NRF_MODEM_GNSS_DELETE_ALMANACS;
	}

	err = nrf_modem_gnss_nv_data_delete(delete_mask);
	if(err)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to delete GNSS data");
	#endif
		return -1;
	}

	return 0;
}

static void ttff_test_prepare_work_fn(struct k_work *item)
{
	/* Make sure GNSS is stopped before next start. */
	nrf_modem_gnss_stop();

	if(IS_ENABLED(CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST_COLD_START))
	{
		if(ttff_test_force_cold_start() != 0)
		{
			return;
		}
	}

#if !defined(CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE)
	if(IS_ENABLED(CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST_COLD_START))
	{
		/* All A-GPS data is always requested before GNSS is started. */
		last_agps.sv_mask_ephe = 0xffffffff;
		last_agps.sv_mask_alm = 0xffffffff;
		last_agps.data_flags =
			NRF_MODEM_GNSS_AGPS_GPS_UTC_REQUEST |
			NRF_MODEM_GNSS_AGPS_KLOBUCHAR_REQUEST |
			NRF_MODEM_GNSS_AGPS_SYS_TIME_AND_SV_TOW_REQUEST |
			NRF_MODEM_GNSS_AGPS_POSITION_REQUEST |
			NRF_MODEM_GNSS_AGPS_INTEGRITY_REQUEST;

		k_work_submit_to_queue(&gnss_work_q, &agps_data_get_work);
	}
	else
	{
		/* Start and stop GNSS to trigger possible A-GPS data request. If new A-GPS
		 * data is needed it is fetched before GNSS is started.
		 */
		nrf_modem_gnss_start();
		nrf_modem_gnss_stop();
	}
#endif /* !CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE */

	k_work_submit_to_queue(&gnss_work_q, &ttff_test_start_work);
}

static void ttff_test_start_work_fn(struct k_work *item)
{
#ifdef GPS_DEBUG
	LOGD("Starting GNSS");
#endif

    if(nrf_modem_gnss_start() != 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to start GNSS");
	#endif
		return;
	}

	gps_start_time = k_uptime_get();
	time_blocked = 0;
}
#endif /* CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST */

static void date_time_evt_handler(const struct date_time_evt *evt)
{
	k_sem_give(&time_sem);
}

static int modem_init(void)
{
    uint8_t tmpbuf[256] = {0};

    if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), "AT+CGMR") == 0)
	{
	#ifdef GPS_DEBUG
		LOGD("MODEM version:%s", &tmpbuf);
	#endif
    }

	if(nrf_modem_at_cmd(tmpbuf, sizeof(tmpbuf), "AT%%HWVERSION") == 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Chip version:%s", &tmpbuf);
	#endif
	}

	if(strlen(CONFIG_GNSS_SAMPLE_AT_MAGPIO) > 0)
	{
		if(nrf_modem_at_printf("%s", CONFIG_GNSS_SAMPLE_AT_MAGPIO) != 0)
		{
		#ifdef GPS_DEBUG
			LOGD("Failed to set MAGPIO configuration");
		#endif
			return -1;
		}
	}

	if(strlen(CONFIG_GNSS_SAMPLE_AT_COEX0) > 0)
	{
		if(nrf_modem_at_printf("%s", CONFIG_GNSS_SAMPLE_AT_COEX0) != 0)
		{
		#ifdef GPS_DEBUG
			LOGD("Failed to set COEX0 configuration");
		#endif
			return -1;
		}
	}

	if(IS_ENABLED(CONFIG_DATE_TIME))
	{
		date_time_register_handler(date_time_evt_handler);
	}

	if(lte_lc_init() != 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to initialize LTE link controller");
	#endif
		return -1;
	}

#if defined(CONFIG_GNSS_SAMPLE_LTE_ON_DEMAND)
	lte_lc_register_handler(lte_lc_event_handler);
#elif !defined(CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE)
	lte_lc_psm_req(true);

#ifdef GPS_DEBUG
	LOGD("Connecting to LTE network");
#endif

	if(lte_lc_connect() != 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to connect to LTE network");
	#endif
		return -1;
	}

#ifdef GPS_DEBUG
	LOGD("Connected to LTE network");
#endif

	uint8_t str[128] = {0};

	if(nrf_modem_at_cmd(str, sizeof(str), "AT%%XSYSTEMMODE?") == 0)
	{
	#ifdef GPS_DEBUG	
		LOGD("XSYSTEMMODE:%s", str);
	#endif
	}

	if(IS_ENABLED(CONFIG_DATE_TIME))
	{
	#ifdef GPS_DEBUG
		LOGD("Waiting for current time");
	#endif

		/* Wait for an event from the Date Time library. */
		k_sem_take(&time_sem, K_MINUTES(10));

		if(!date_time_is_valid())
		{
		#ifdef GPS_DEBUG
			LOGD("Failed to get current time, continuing anyway");
		#endif
		}
	}
#endif

	return 0;
}

static int gps_work_init(void)
{
	int err = 0;

#if !defined(CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE) || defined(CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST)
	struct k_work_queue_config cfg = {
		.name = "gnss_work_q",
		.no_yield = false
	};

	k_work_queue_start(
		&gnss_work_q,
		gnss_workq_stack_area,
		K_THREAD_STACK_SIZEOF(gnss_workq_stack_area),
		GNSS_WORKQ_THREAD_PRIORITY,
		&cfg);
#endif /* !CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE || CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST */

