duxinglang-1/nRF9160_test/E2_V1_NCS1.9.0_TEST/src/gps/gps.c
#if !defined(CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE)
	k_work_init(&agps_data_get_work, agps_data_get_work_fn);

	err = assistance_init(&gnss_work_q);
#endif /* !CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE */

#if defined(CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST)
	k_work_init_delayable(&ttff_test_got_fix_work, ttff_test_got_fix_work_fn);
	k_work_init_delayable(&ttff_test_prepare_work, ttff_test_prepare_work_fn);
	k_work_init(&ttff_test_start_work, ttff_test_start_work_fn);
#endif /* CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST */

	k_work_init(&gps_data_get_work, gps_data_get_work_fn);
	return err;
}

static int gnss_init_and_start(void)
{
#if defined(CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE) || defined(CONFIG_GNSS_SAMPLE_LTE_ON_DEMAND)
	/* Enable GNSS. */
	if(lte_lc_func_mode_set(LTE_LC_FUNC_MODE_ACTIVATE_GNSS) != 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to activate GNSS functional mode");
	#endif
		return -1;
	}
#endif /* CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE || CONFIG_GNSS_SAMPLE_LTE_ON_DEMAND */

	/* Configure GNSS. */
	if(nrf_modem_gnss_event_handler_set(gnss_event_handler) != 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to set GNSS event handler");
	#endif
		return -1;
	}

	/* Enable all supported NMEA messages. */
	uint16_t nmea_mask = NRF_MODEM_GNSS_NMEA_RMC_MASK |
			     NRF_MODEM_GNSS_NMEA_GGA_MASK |
			     NRF_MODEM_GNSS_NMEA_GLL_MASK |
			     NRF_MODEM_GNSS_NMEA_GSA_MASK |
			     NRF_MODEM_GNSS_NMEA_GSV_MASK;

	if(nrf_modem_gnss_nmea_mask_set(nmea_mask) != 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to set GNSS NMEA mask");
	#endif
		return -1;
	}

	/* This use case flag should always be set. */
	uint8_t use_case = NRF_MODEM_GNSS_USE_CASE_MULTIPLE_HOT_START;

	if(IS_ENABLED(CONFIG_GNSS_SAMPLE_MODE_PERIODIC) 
		&& !IS_ENABLED(CONFIG_GNSS_SAMPLE_ASSISTANCE_NONE))
	{
		/* Disable GNSS scheduled downloads when assistance is used. */
		use_case |= NRF_MODEM_GNSS_USE_CASE_SCHED_DOWNLOAD_DISABLE;
	}

	if(IS_ENABLED(CONFIG_GNSS_SAMPLE_LOW_ACCURACY))
	{
		use_case |= NRF_MODEM_GNSS_USE_CASE_LOW_ACCURACY;
	}

	if(nrf_modem_gnss_use_case_set(use_case) != 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to set GNSS use case");
	#endif
	}

#if defined(CONFIG_NRF_CLOUD_AGPS_ELEVATION_MASK)
	if(nrf_modem_gnss_elevation_threshold_set(CONFIG_NRF_CLOUD_AGPS_ELEVATION_MASK) != 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to set elevation threshold");
	#endif
		return -1;
	}
#ifdef GPS_DEBUG
	LOGD("Set elevation threshold to %u", CONFIG_NRF_CLOUD_AGPS_ELEVATION_MASK);
#endif
#endif

#if defined(CONFIG_GNSS_SAMPLE_MODE_CONTINUOUS)
	/* Default to no power saving. */
	uint8_t power_mode = NRF_MODEM_GNSS_PSM_DISABLED;

#if defined(GNSS_SAMPLE_POWER_SAVING_MODERATE)
	power_mode = NRF_MODEM_GNSS_PSM_DUTY_CYCLING_PERFORMANCE;
#elif defined(GNSS_SAMPLE_POWER_SAVING_HIGH)
	power_mode = NRF_MODEM_GNSS_PSM_DUTY_CYCLING_POWER;
#endif

	if(nrf_modem_gnss_power_mode_set(power_mode) != 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to set GNSS power saving mode");
	#endif
		return -1;
	}
#endif /* CONFIG_GNSS_SAMPLE_MODE_CONTINUOUS */

	/* Default to continuous tracking. */
	uint16_t fix_retry = 0;
	uint16_t fix_interval = 1;

#if defined(CONFIG_GNSS_SAMPLE_MODE_PERIODIC)
	fix_retry = CONFIG_GNSS_SAMPLE_PERIODIC_TIMEOUT;
	fix_interval = CONFIG_GNSS_SAMPLE_PERIODIC_INTERVAL;
#elif defined(CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST)
	/* Single fix for TTFF test mode. */
	fix_retry = 0;
	fix_interval = 0;
#endif

	if(nrf_modem_gnss_fix_retry_set(fix_retry) != 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to set GNSS fix retry");
	#endif
		return -1;
	}

	if(nrf_modem_gnss_fix_interval_set(fix_interval) != 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to set GNSS fix interval");
	#endif
		return -1;
	}

#if defined(CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST)
	k_work_schedule_for_queue(&gnss_work_q, &ttff_test_prepare_work, K_NO_WAIT);
#else /* !CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST */
	if(nrf_modem_gnss_start() != 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to start GNSS");
	#endif
		return -1;
	}
#endif

	return 0;
}

static void print_satellite_stats(struct nrf_modem_gnss_pvt_data_frame *pvt_data)
{
	uint8_t tracked   = 0;
	uint8_t in_fix    = 0;
	uint8_t unhealthy = 0;

	for(int i = 0; i < NRF_MODEM_GNSS_MAX_SATELLITES; ++i)
	{
		if(pvt_data->sv[i].sv > 0)
		{
			tracked++;

			if(pvt_data->sv[i].flags & NRF_MODEM_GNSS_SV_FLAG_USED_IN_FIX)
			{
				in_fix++;
			}

			if(pvt_data->sv[i].flags & NRF_MODEM_GNSS_SV_FLAG_UNHEALTHY)
			{
				unhealthy++;
			}
		}
	}

#ifdef GPS_DEBUG
	LOGD("Tracking: %2d Using: %2d Unhealthy: %d\n", tracked, in_fix, unhealthy);
#endif
}

static void print_fix_data(struct nrf_modem_gnss_pvt_data_frame *pvt_data)
{
    uint8_t tmpbuf[256] = {0};

#ifdef GPS_DEBUG
    int32_t lon, lat;

    lon = pvt_data->longitude*1000000;
    lat = pvt_data->latitude*1000000;
    sprintf(tmpbuf, "Longitude:%d.%06d, Latitude:%d.%06d", lon/1000000, lon%1000000, lat/1000000, lat%1000000);
    LOGD("%s",tmpbuf);
	LOGD("Date:           %04u-%02u-%02u\n",
	       pvt_data->datetime.year,
	       pvt_data->datetime.month,
	       pvt_data->datetime.day);
	LOGD("Time (UTC):     %02u:%02u:%02u.%03u\n",
	       pvt_data->datetime.hour,
	       pvt_data->datetime.minute,
	       pvt_data->datetime.seconds,
	       pvt_data->datetime.ms);
#endif
}

static void gps_data_get_work_fn(struct k_work *item)
{
	ARG_UNUSED(item);

	uint8_t cnt = 0;
	struct nrf_modem_gnss_nmea_data_frame *nmea_data;

	for(;;)
	{
		(void)k_poll(events, 2, K_FOREVER);

		if(events[0].state == K_POLL_STATE_SEM_AVAILABLE 
			&& k_sem_take(events[0].sem, K_NO_WAIT) == 0)
		{
			/* New PVT data available */

			if(!IS_ENABLED(CONFIG_GNSS_SAMPLE_NMEA_ONLY))
			{
				//print_satellite_stats(&last_pvt);
			#ifdef GPS_DEBUG
				LOGD("pvt");
			#endif

				if(test_gps_flag)
				{
					uint8_t i,tracked = 0;
					uint8_t strbuf[128] = {0};
					int32_t lon,lat;
					
					memset(gps_test_info, 0x00, sizeof(gps_test_info));
					
					for(i=0;i<NRF_MODEM_GNSS_MAX_SATELLITES;i++)
					{
						uint8_t buf[128] = {0};
						
						if(last_pvt.sv[i].sv > 0)
						{
							tracked++;
						#if defined(LCD_VGM068A4W01_SH1106G)||defined(LCD_VGM096064A6W01_SP5090)
							if(tracked<8)
							{
								sprintf(buf, "%02d|", last_pvt.sv[i].cn0/10);
								strcat(strbuf, buf);
							}
						#else
							sprintf(buf, "%02d|%02d;", last_pvt.sv[i].sv, last_pvt.sv[i].cn0/10);
							strcat(strbuf, buf);
						#endif
						}
					}
	
				#if defined(LCD_VGM068A4W01_SH1106G)||defined(LCD_VGM096064A6W01_SP5090)
					sprintf(gps_test_info, "%02d,", tracked);
				#else
					sprintf(gps_test_info, "%02d\n", tracked);
				#endif
					strcat(gps_test_info, strbuf);
					gps_test_update_flag = true;
				}

				if(last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_DEADLINE_MISSED)
				{
				#ifdef GPS_DEBUG
					LOGD("GNSS operation blocked by LTE");
				#endif
				}
				
