duxinglang-1/nRF9160_test/E2_V1_NCS1.9.0_TEST/src/gps/gps.c
				if(last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_NOT_ENOUGH_WINDOW_TIME)
				{
				#ifdef GPS_DEBUG
					LOGD("Insufficient GNSS time windows");
				#endif
				}
				
				if(last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_SLEEP_BETWEEN_PVT)
				{
				#ifdef GPS_DEBUG
					LOGD("Sleep period(s) between PVT notifications");
				#endif
				}

				if(last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID)
				{
				#ifdef GPS_DEBUG
					LOGD("NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID");
				#endif

					if(gps_fix_time == 0)
					{
						gps_fix_time = k_uptime_get();
						gps_local_time = gps_fix_time-gps_start_time;
					}
		
					if(!test_gps_flag)
					{
					#ifdef GPS_DEBUG
						LOGD("Position fix with NMEA data, fix time:%d", gps_local_time);
					#endif
						APP_Ask_GPS_off();

						if(k_timer_remaining_get(&app_wait_gps_timer) > 0)
							k_timer_stop(&app_wait_gps_timer);

						k_timer_start(&app_send_gps_timer, K_MSEC(1000), K_NO_WAIT);
					}
					else
					{
						uint8_t strbuf[128] = {0};
						int32_t lon,lat;
						
					#if defined(LCD_VGM068A4W01_SH1106G)||defined(LCD_VGM096064A6W01_SP5090)
						strcat(gps_test_info, "\n");	//2行没显示满，多换行一行
						if(gps_fix_time > 0)
						{
							sprintf(strbuf, "fix:%dS", gps_local_time/1000);
							strcat(gps_test_info, strbuf);
						}
					#else
						strcat(gps_test_info, "\n");
						
						lon = last_pvt.longitude*1000000;
						lat = last_pvt.latitude*1000000;
						sprintf(strbuf, "Lon:   %d.%06d\nLat:    %d.%06d\n", lon/1000000, lon%1000000, lat/1000000, lat%1000000);
						strcat(gps_test_info, strbuf);
				
						if(gps_fix_time > 0)
						{
							sprintf(strbuf, "fix time:    %dS", gps_local_time/1000);
							strcat(gps_test_info, strbuf);
						}
					#endif
					
						gps_test_update_flag = true;
					}
					
				#ifdef GPS_DEBUG
					print_fix_data(&last_pvt);
				#endif
				}
				else
				{
				#ifdef GPS_DEBUG
					LOGD("Seconds since last fix: %lld", (k_uptime_get() - gps_start_time) / 1000);
				#endif
					cnt++;
				#ifdef GPS_DEBUG
					LOGD("Searching [%c]", update_indicator[cnt%4]);
				#endif
				}
			}
		#if defined(CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST)
			else
			{
				/* Calculate the time GNSS has been blocked by LTE. */
				if(last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_DEADLINE_MISSED)
				{
					time_blocked++;
				}
			}
		#endif/*CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST*/
		}
		if(events[1].state == K_POLL_STATE_MSGQ_DATA_AVAILABLE 
			&& k_msgq_get(events[1].msgq, &nmea_data, K_NO_WAIT) == 0)
		{
			/* New NMEA data available */
		#ifdef GPS_DEBUG
			LOGD("NMEA:%s", nmea_data->nmea_str);
		#endif

			k_free(nmea_data);
		}

		events[0].state = K_POLL_STATE_NOT_READY;
		events[1].state = K_POLL_STATE_NOT_READY;

		if(!gps_is_on)
			break;
	}
}

bool APP_GPS_data_send(bool fix_flag)
{
	bool ret = false;
	
	if(ble_wait_gps)
	{
		APP_get_gps_data_reply(fix_flag, last_pvt);
		ble_wait_gps = false;
		ret = true;
	}

	if(sos_wait_gps)
	{
		sos_get_gps_data_reply(fix_flag, last_pvt);
		sos_wait_gps = false;
		ret = true;
	}

#if defined(CONFIG_IMU_SUPPORT)&&defined(CONFIG_FALL_DETECT_SUPPORT)
	if(fall_wait_gps)
	{
		fall_get_gps_data_reply(fix_flag, last_pvt);
		fall_wait_gps = false;
		ret = true;
	}
#endif

	if(location_wait_gps)
	{
		location_get_gps_data_reply(fix_flag, last_pvt);
		location_wait_gps = false;
		ret = true;
	}

	return ret;
}

void APP_Ask_GPS_Data_timerout(struct k_timer *timer)
{
	if(!test_gps_flag)
		gps_off_flag = true;

	gps_send_data_flag = true;
}

void APP_Ask_GPS_Data(void)
{
	static uint8_t time_init = false;

#if 1
	if(!gps_is_on)
	{
		gps_on_flag = true;
		k_timer_start(&app_wait_gps_timer, K_MSEC(5*60*1000), K_NO_WAIT);
	}
#else
	last_pvt.datetime.year = 2020;
	last_pvt.datetime.month = 11;
	last_pvt.datetime.day = 4;
	last_pvt.datetime.hour = 2;
	last_pvt.datetime.minute = 20;
	last_pvt.datetime.seconds = 40;
	last_pvt.longitude = 114.025254;
	last_pvt.latitude = 22.667808;
	gps_local_time = 1000;
	
	APP_Ask_GPS_Data_timerout(NULL);
#endif
}

void APP_Send_GPS_Data_timerout(struct k_timer *timer)
{
	gps_send_data_flag = true;
}

void APP_Ask_GPS_off(void)
{
	if(!test_gps_flag)
		gps_off_flag = true;
}

bool gps_is_working(void)
{
#ifdef GPS_DEBUG
	LOGD("gps_is_on:%d", gps_is_on);
#endif
	return gps_is_on;
}

void gps_turn_off(void)
{
#ifdef GPS_DEBUG
	LOGD("begin");
#endif

	nrf_modem_gnss_stop();
	gps_is_on = false;
}

void gps_off(void)
{
	if(!gps_is_on)
		return;

	gps_turn_off();
}

void gps_turn_on(void)
{
	uint8_t cnt = 0;
	struct nrf_modem_gnss_nmea_data_frame *nmea_data;

	if(modem_init() != 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to initialize modem");
	#endif
		return;
	}

	if(gnss_init_and_start() != 0)
	{
	#ifdef GPS_DEBUG
		LOGD("Failed to initialize and start GNSS");
	#endif
		return;
	}

	gps_is_on = true;
	gps_fix_time = 0;
	gps_local_time = 0;
	memset(&last_pvt, 0, sizeof(last_pvt));
	gps_start_time = k_uptime_get();

#ifdef GPS_DEBUG
	LOGD("begin");
#endif

	k_work_submit_to_queue(&gnss_work_q, &gps_data_get_work);
}

void gps_on(void)
{
	if(gps_is_on)
		return;
	
	gps_turn_on();
}

void gps_test_update(void)
{
	if(screen_id == SCREEN_ID_GPS_TEST)
		scr_msg[screen_id].act = SCREEN_ACTION_UPDATE;
}

void MenuStartGPS(void)
{
	test_gps_flag = true;
	gps_on_flag = true;
}

void MenuStopGPS(void)
{
	test_gps_flag = false;
	gps_off_flag = true;
}

void test_gps_on(void)
{
	test_gps_flag = true;
	EnterGPSTestScreen();
	gps_on();
}

void test_gps_off(void)
{
	test_gps_flag = false;
	gps_off();
	EnterIdleScreen();
}

void GPS_init(void)
{
	gps_work_init();
}

void GPSMsgProcess(void)
{
	if(gps_test_start_flag)
	{
		gps_test_start_flag = false;
		test_gps_on();
	}
	if(gps_on_flag)
	{
		gps_on_flag = false;
		gps_on();
	}
	
	if(gps_off_flag)
	{
		gps_off_flag = false;
		gps_off();
	}

	if(gps_send_data_flag)
	{
		gps_send_data_flag = false;
		if(gps_local_time > 0)
		{
			APP_GPS_data_send(true);
		}
		else
		{
			APP_GPS_data_send(false);
		}
	}
	
	if(gps_test_update_flag)
	{
		gps_test_update_flag = false;
		gps_test_update();
	}
	
	if(gps_is_on)
	{
		k_sleep(K_MSEC(5));
	}
}
